<?php include $_SERVER["DOCUMENT_ROOT"] . "/template/header.php"; ?>

    <div class="aboutMe">
            Привет, посетитель. Я разработчик этого сайта. Я познакомился с данной группой совсем недавно, в 2020 году. Однако мне успели понравиться их песни, их жанр. Смотря различные сайты по данной группе, в том числе и официальный, я обнаружил, что где-то нет биографии солистов, где-то нет текстов песен. Поэтому я решил сделать сайт на котором вся информация будет собрана в одном месте. Вся информация взята из различных открытых проверенных источников. Надеюсь, сайт вам понравится.
        <br><br>
                                                                 С уважением, Разработчик.

    </div>

<?php include $_SERVER["DOCUMENT_ROOT"] . "/template/footer.php"; ?>